tutorials/viscoelastic/viscoelasticFluidFoam/Leonov/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          PCG;
        preconditioner  Cholesky;

        tolerance        1e-07;
        relTol           0;
        minIter          0;
        maxIter          800;
    }

    U
    {

        solver           BiCGStab;
        preconditioner   ILU0;

        tolerance         1e-6;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }

    sigma
    {

        solver           BiCGStab;
        preconditioner   ILU0;

        tolerance         1e-6;
        relTol            0;
        minIter           0;
        maxIter           1000;

    }

}

PISO
{
    nCorrectors    2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    p               0.3;
    U               0.5;
    tau             0.3;
}


// ************************************************************************* //
